; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	spectrograph0 - mode
	spectrograph4 - mode
	infrared2 - mode
	image3 - mode
	image1 - mode
	Star2 - direction
	Star5 - direction
	GroundStation7 - direction
	GroundStation3 - direction
	Star1 - direction
	Star4 - direction
	GroundStation8 - direction
	Star6 - direction
	GroundStation0 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 image3)
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument2 image3)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star1)
	(supports instrument3 image1)
	(supports instrument3 image3)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star6)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet14)
	(supports instrument4 image1)
	(calibration_target instrument4 Star6)
	(calibration_target instrument4 GroundStation8)
	(calibration_target instrument4 Star9)
	(supports instrument5 image3)
	(calibration_target instrument5 Star9)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star4)
)
(:goal (and
	(pointing satellite2 Phenomenon12)
	(have_image Star10 image3)
	(have_image Star11 infrared2)
	(have_image Phenomenon12 spectrograph4)
	(have_image Phenomenon13 spectrograph4)
	(have_image Planet14 spectrograph4)
	(have_image Star15 spectrograph4)
	(have_image Planet16 image1)
))

)

; plan
1. (turn_to satellite1 star6 planet14)
   deleted: (pointing satellite1 planet14)
   added: (pointing satellite1 star6)
   goals met: 0 of 8
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 8
3. (calibrate satellite1 instrument3 star6)
   added: (calibrated instrument3)
   goals met: 0 of 8
4. (turn_to satellite1 planet16 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet16)
   goals met: 0 of 8
5. (turn_to satellite0 star1 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star1)
   goals met: 0 of 8
6. (take_image satellite1 planet16 instrument3 image1)
   added: (have_image planet16 image1)
   goals met: 1 of 8
7. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
8. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 1 of 8
9. (turn_to satellite0 phenomenon12 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 8
10. (take_image satellite0 phenomenon12 instrument0 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 2 of 8
11. (turn_to satellite0 phenomenon13 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 8
12. (take_image satellite0 phenomenon13 instrument0 spectrograph4)
   added: (have_image phenomenon13 spectrograph4)
   goals met: 3 of 8
13. (turn_to satellite0 planet14 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet14)
   goals met: 3 of 8
14. (take_image satellite0 planet14 instrument0 spectrograph4)
   added: (have_image planet14 spectrograph4)
   goals met: 4 of 8
15. (turn_to satellite0 star10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star10)
   goals met: 4 of 8
16. (take_image satellite0 star10 instrument0 image3)
   added: (have_image star10 image3)
   goals met: 5 of 8
17. (turn_to satellite0 star15 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star15)
   goals met: 5 of 8
18. (take_image satellite0 star15 instrument0 spectrograph4)
   added: (have_image star15 spectrograph4)
   goals met: 6 of 8
19. (turn_to satellite1 star11 planet16)
   deleted: (pointing satellite1 planet16)
   added: (pointing satellite1 star11)
   goals met: 6 of 8
20. (take_image satellite1 star11 instrument3 infrared2)
   added: (have_image star11 infrared2)
   goals met: 7 of 8
21. (turn_to satellite2 phenomenon12 star4)
   deleted: (pointing satellite2 star4)
   added: (pointing satellite2 phenomenon12)
   goals met: 8 of 8
